// 요구 사항 정리
// TODO 메뉴 추가

// -[v] 메뉴의 이름을 입력받고 확인 버튼을 누르면 메뉴가 추가된다.
// -[v] 메뉴의 이름을 입력받고 엔터키를 눌려도 메뉴가 추가된다.
// -추가되는 메뉴의 마크업은 `<ul id="espresso-menu-list" class="mt-3 pl-0"></ul>` 안에 삽입해야 한다.
// -[] 메뉴가 추가되면 input 은 빈값으로 초기화 한다.
// -[] 만약 빈값을 입력했으면 메뉴 추가가 되지 않고 prompt 창을 띄운다.
// -[] 빈값을 입력하고 엔터키를 눌러도 메뉴가 추가되지 않고 prompt 창을 띄운다.
// -[] 메뉴가 추가될때마다 총 개수의 정보가 변경된다.

// TODO 메뉴 수정
// -[] 수정 버튼을 누르면 모달 창이 뜨고 수정 메뉴 이름을 입력받는다.
// -[] 모달창이 뜰때 메뉴 이름은 기본적으로 원래 이름이 들어가 있다.
// -[] 수정 완료 버튼을 누르면 해당 메뉴의 이름이 바뀐다.

// TODO 메뉴 삭제
// -[] 메뉴 삭제버튼을 누르면 확인하는 prompt 창이 뜨고 확인을 누르면 해당 메뉴를 삭제한다.
// -[] 메뉴의 총 개수도 업데이트 한다.
